sim/templates/openfoam_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0    0    0)
    (__L__ 0    0)
    (__L__ __H__ 0)
    (0    __H__ 0)

    (0    0    0.01)
    (__L__ 0    0.01)
    (__L__ __H__ 0.01)
    (0    __H__ 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 64 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
